In [16]:
from pandas import Series
series1=Series([1,2,3,4,5,6])
series2=Series([100,200,300,],index=['speed','temp','humidity'])

In [17]:
series1+series2

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
humidity   NaN
speed      NaN
temp       NaN
dtype: float64

In [18]:
from pandas import DataFrame
data1={'speed':[100,200,300],
      'temp':[12,56,45]}

In [19]:
data1

{'speed': [100, 200, 300], 'temp': [12, 56, 45]}

In [20]:
frame1=DataFrame(data1)

In [21]:
frame1

   speed  temp
0    100    12
1    200    56
2    300    45

In [22]:
data2={'speed':[100,200,300],
      'temp':[12,56,45],
      'humidity':[78,90,67]}

In [23]:
data2

{'speed': [100, 200, 300], 'temp': [12, 56, 45], 'humidity': [78, 90, 67]}

In [24]:
frame2=DataFrame(data2)

In [25]:
frame2

   speed  temp  humidity
0    100    12        78
1    200    56        90
2    300    45        67

In [26]:
frame1+frame2

   humidity  speed  temp
0       NaN    200    24
1       NaN    400   112
2       NaN    600    90

In [29]:
frame2

   speed  temp  humidity
0    100    12        78
1    200    56        90
2    300    45        67

In [30]:
series2

speed       100
temp        200
humidity    300
dtype: int64

In [31]:
frame2-series2

   speed  temp  humidity
0      0  -188      -222
1    100  -144      -210
2    200  -155      -233

In [32]:
frame2*series2

   speed   temp  humidity
0  10000   2400     23400
1  20000  11200     27000
2  30000   9000     20100

In [33]:
frame2+series2

   speed  temp  humidity
0    200   212       378
1    300   256       390
2    400   245       367

In [35]:
from pandas import Series
series1=Series([1,2,300],index=['id','quantity','price'])
series2=Series([2,1,100],index=['id','quantity','price'])

In [36]:
series1

id            1
quantity      2
price       300
dtype: int64

In [37]:
series2

id            2
quantity      1
price       100
dtype: int64

In [38]:
from pandas import DataFrame
data1={'id':[1,2],
      'quantity':[2,4],
      'price':[400,500]}
data2={'id':[1,2],
      'quantity':[2,4],
      'price':[400,500]}

In [39]:
frame1=DataFrame(data1)
frame2=DataFrame(data2)

In [40]:
frame1

   id  quantity  price
0   1         2    400
1   2         4    500

In [41]:
frame2

   id  quantity  price
0   1         2    400
1   2         4    500

In [42]:
frame1-series1

   id  quantity  price
0   0         0    100
1   1         2    200

In [43]:
frame1+series1

   id  quantity  price
0   2         4    700
1   3         6    800

In [44]:
frame2-series2

   id  quantity  price
0  -1         1    300
1   0         3    400

In [45]:
frame2+series2

   id  quantity  price
0   3         3    500
1   4         5    600

In [46]:
ser=Series([5,6,7,8,9],index=[2,4,1,5,3])

In [47]:
ser

2    5
4    6
1    7
5    8
3    9
dtype: int64

In [48]:
ser.sort_index()

1    7
2    5
3    9
4    6
5    8
dtype: int64